fermarsan/aixt/ports/Cypress/CY8CKIT-145-40XX/examples/Configuracion_General.cydsn/Generated_Source/PSoC4/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.4
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2020 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "uart.h"
#include "uart_SPI_UART.h"
#include "uart_PINS.h"
#include "uart_SPI_UART_PVT.h"
#include "uart_PVT.h"
#include "uart_BOOT.h"
#include "pwm1.h"
#include "clock.h"
#include "pwm_1.h"
#include "pwm_1_aliases.h"
#include "pwm2.h"
#include "pwm_2.h"
#include "pwm_2_aliases.h"
#include "pwm0.h"
#include "pwm_0.h"
#include "pwm_0_aliases.h"
#include "led5.h"
#include "led5_aliases.h"
#include "led4.h"
#include "led4_aliases.h"
#include "capsense.h"
#include "capsense_Control.h"
#include "capsense_Filter.h"
#include "capsense_Processing.h"
#include "capsense_Sensing.h"
#include "capsense_Structure.h"
#include "capsense_Tuner.h"
#include "capsense_Configuration.h"
#include "capsense_SensingCSD_LL.h"
#include "capsense_SensingCSX_LL.h"
#include "capsense_RegisterMap.h"
#include "capsense_Centroid_LL.h"
#include "led6.h"
#include "led6_aliases.h"
#include "led7.h"
#include "led7_aliases.h"
#include "led8.h"
#include "led8_aliases.h"
#include "led9.h"
#include "led9_aliases.h"
#include "led10.h"
#include "led10_aliases.h"
#include "led11.h"
#include "led11_aliases.h"
#include "sw2.h"
#include "sw2_aliases.h"
#include "led1.h"
#include "led1_aliases.h"
#include "di1.h"
#include "di1_aliases.h"
#include "do1.h"
#include "do1_aliases.h"
#include "di2.h"
#include "di2_aliases.h"
#include "do2.h"
#include "do2_aliases.h"
#include "di0.h"
#include "di0_aliases.h"
#include "do0.h"
#include "do0_aliases.h"
#include "uart_SCBCLK.h"
#include "uart_tx.h"
#include "uart_tx_aliases.h"
#include "uart_rx.h"
#include "uart_rx_aliases.h"
#include "capsense_ISR.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cyPm.h"
#include "cytypes.h"
#include "cypins.h"
#include "core_cm0plus_psoc4.h"
#include "CyLFClk.h"
#include "cy_em_eeprom.h"

/*[]*/

